import React, { useEffect } from 'react';
import { Container} from 'react-bootstrap';
import '../styles/Home.css'
import { Grid } from '@mui/material';
import { useState } from 'react';
import SearchAppBar from '../SearchAppBar';
import { useUserContext } from '../UserContext';
import '../styles/Accessibility.css'

export default function AccessibilityDec(props) {

    const [isVisible, setIsVisible] = useState(false);
    const {getFilters} = useUserContext();

    useEffect(() => {
        setIsVisible(true);

      }, []);



    return (
        <div className={`home ${isVisible ? 'visible' : 'notVisable'}`}>
            <Container style={{direction:'rtl', textAlign:'right', backgroundColor:'#1E2423', paddingBottom:'3.5rem'}}>
        <h1>הצהרת נגישות</h1>
        <p className="acceabilityP">
        לורן בר יין אחראי על הקמת והפעלת אתר  https://laurenwinebar.com . אנו רואים חשיבות רבה במתן שירות שוויוני לכלל האזרחים ובשיפור השירות הניתן לאזרחים עם מוגבלות.
 אנו משקיעים משאבים רבים בהנגשת האתר והנכסים הדיגיטליים שלנו על מנת להפוך את שירותי החברה לזמינים יותר עבור אנשים עם מוגבלות.
במדינת ישראל כ-20 אחוזים מקרב האוכלוסייה הינם אנשים עם מוגבלות הזקוקים לנגישות דיגיטלית, על מנת לצרוך מידע ושירותים כללים.
הנגשת האתר של לורן בר יין נועדה להפוך אותו לזמין, ידידותי ונוח יותר לשימוש עבור אוכלוסיות עם צרכים מיוחדים, הנובעים בין היתר ממוגבלויות מוטוריות שונות,
לקויות קוגניטיביות, קוצר רואי, עיוורון או עיוורון צבעים, לקויות שמיעה וכן אוכלוסייה הנמנית על בני הגיל השלישי. <br/>
הנגשת אתר זה בוצעה על ידי חברת הנגשת האתרים "Vee הנגשת אתרים".
</p>
<h2>רמת הנגישות באתר - AA</h2>
<p className="acceabilityP">חברת "Vee", התאימה את נגישות האתר לדפדפנים הנפוצים ולשימוש בטלפון הסלולרי ככל הניתן, והשתמשה בבדיקותיה בקוראי מסך מסוג Jaws ו- NVDA.
מקפידה על עמידה בדרישות תקנות שוויון זכויות לאנשים עם מוגבלות 5688 התשע"ג 2013 ברמת AA. וכן, מיישמת את המלצות מסמך WCAG2.2 מאת ארגון W3C.<br/>
בעברית: <a href="https://www.isoc.org.il/files/w3c-wai/guidelines.html">WCAG 2.0 הנחיות לנגישות תכנים באינטרנט</a><br/>
באנגלית: <a href="https://www.w3.org/TR/WCAG20/">WCAG 20 Web Content Accessibility Guidelines</a><br/>
</p>
<h2>כיצד עוברים למצב נגיש?</h2>
<p className="acceabilityP">
באתר מוצב אייקון נגישות (בד"כ בדפנות האתר). לחיצה על האייקון מאפשרת פתיחת של תפריט הנגישות. לאחר בחירת הפונקציה המתאימה בתפריט יש להמתין לטעינת הדף ולשינוי הרצוי בתצוגה (במידת הצורך).<br/>
במידה ומעוניינים לבטל את הפעולה, יש ללחוץ על הפונקציה בתפריט פעם שניה. בכל מצב, ניתן לאפס הגדרות נגישות.<br/>
התוכנה פועלת בדפדפנים הפופולריים: Chrome, Firefox, Safari, Opera בכפוף (תנאי יצרן) הגלישה במצב נגישות מומלצת בדפדפן כרום.<br/>
האתר מספק מבנה סמנטי עבור טכנולוגיות מסייעות ותמיכה בדפוס השימוש המקובל להפעלה עם מקלדת בעזרת מקשי החיצים, Enter ו- Esc ליציאה מתפריטים וחלונות.<br/>
לצורך קבלת חווית גלישה מיטבית עם תוכנת הקראת מסך, אנו ממליצים לשימוש בתוכנת  NVDA העדכנית ביותר.
</p>
<h2>תיקונים והתאמות שבוצעו באתר:</h2>
<p className="acceabilityP">
התאמה לקורא מסך - התאמת האתר עבור טכנולוגיות מסייעות כגון NVDA , JAWS<br/>
אמצעי הניווט באתר פשוטים וברורים.<br/>
תכני האתר כתובים באופן ברור, מסודר והיררכי. <br/>
האתר מותאם לצפייה בדפדפנים מודרניים.<br/>
התאמת האתר לתצוגה תואמת מגוון מסכים ורזולוציות.<br/>
כל הדפים באתר בעלי מבנה קבוע (1H/2H/3H וכו').<br/>
לכל התמונות באתר יש הסבר טקסטואלי חלופי (alt).<br/>
</p>
<h2>פונקציונליות תוכנת נגישות:</h2>
<p className="acceabilityP">
התאמה לקורא מסך - התאמת האתר עבור טכנולוגיות מסייעות כגון NVDA , JAWS<br/>
עצירת הבהובים - עצירת אלמנטים נעים וחסימת אנימציות<br/>
דילוג ישיר לתוכן - דילוג על התפריט הראשי ישירות אל התוכן.<br/>
התאמה לניווט מקלדת <br/>
הגדלה / הקטנה של טקסט<br/>
ריווח בין אותיות / מילים / שורות<br/>
ניגודיות וצבע - גבוהה, הפוכה, שחור לבן<br/>
גופן קריא<br/>
הדגשת קישורים<br/>
מדריך קריאה<br/>
שינוי אייקון סמן עכבר<br/>
תיאור לתמונות<br/>
</p>
<h2>החרגות</h2>
<p className="acceabilityP">חשוב לציין, כי למרות מאמצינו להנגיש את כלל הדפים והאלמנטים באתר, ייתכן שיתגלו חלקים או יכולות שלא הונגשו כראוי או שטרם הונגשו.
אנו פועלים לשפר את נגישות האתר שלנו כל העת, כחלק ממחויבותנו לאפשר לכלל האוכלוסייה להשתמש בו, כולל אנשים עם מוגבלות.
</p>

<h3>נגישות עסק פרונטלי</h3>
<p className="acceabilityP">
    חניית נכים – יש<br/>
גישה נגישה לעסק (עבור כיסא גלגלים) – יש<br/>
שירותי נכים – יש<br/>
מעליות –קומת קרקע<br/>
</p>
<h3>יצירת קשר בנושא נגישות</h3>
<p className="acceabilityP">במידה ונתקלתם בבעיה בנושא נגישות באתר, נשמח לקבל הערות ובקשות באמצעות פנייה לרכז הנגישות שלנו:</p>
<p className="acceabilityP">על מנת שנוכל לטפל בבעיה בדרך הטובה ביותר, אנו ממליצים מאוד לצרף פרטים מלאים ככל שניתן:</p>
<ul>
    <li className="acceabilityP">תיאור הבעיה.</li>
    <li className="acceabilityP">מהי הפעולה שניסיתם לבצע.</li>
    <li className="acceabilityP">קישור לדף שבו גלשתם.</li>
    <li className="acceabilityP">סוג הדפדפן וגרסתו.</li>
    <li className="acceabilityP">סוג המערכת וגרסתה.</li>
    <li className="acceabilityP">מערכת הפעלה.</li>
    <li className="acceabilityP">סוג הטכנולוגיה המסייעת (במידה והשתמשתם).</li>
</ul>
<p className="acceabilityP">לורן בר יין תעשה ככל יכולה על מנת להנגיש את האתר בצורה המיטבית ולענות לפניות בצורה המקצועית והמהירה ביותר.</p>

<p className="acceabilityP">רכז נגישות:</p>
<p className="acceabilityP">אוריין ברנע</p>
<p className="acceabilityP">0543122662</p>
<p className="acceabilityP">Lauren.wine.bar@gmail.com</p>
   </Container>
        </div>
     
    );
};
